<template>
  <div class="q-pa-md" style="max-width: 400px">
    <div class="q-gutter-md">
    <q-form
      @submit="onSubmit"
      @reset="onReset"
      class="q-gutter-md"
    >
    <q-select
        filled
        v-model="model"
        :options="options"
        label="การป้องกันด้วยสารเคมี"
      />
      <q-badge color="blue" multi-line v-if="model!=null"> ชนิดของสารเคมี: "{{ model.label }}" </q-badge>
      <q-badge color="blue" multi-line  v-if="model!=null"> คำอธิบายวิธีการใช้สารเคมี: "{{ model.description }}" </q-badge>

      <q-input
        filled
        v-model="model.label" v-if="model!=null"
        label="ชนิดของสารเคมี  *"
      />
      <q-input
        filled
        v-model="model.description" v-if="model!=null"
        label="คำอธิบายวิธีการใช้สารเคมี *"
      />
      <div>
        <q-btn label="Submit" type="submit" color="primary"/>
        <q-btn label="Reset" type="reset" color="primary" flat class="q-ml-sm" />
      </div>
    </q-form>
    </div>
  </div>
</template>

<script>
import { useQuasar } from 'quasar'
import { ref } from "vue";

export default {
  setup() {
    const $q = useQuasar()

    const name = ref(null)
    const age = ref(null)
    const accept = ref(false)
    const model= ref(null)
    const options= [
        {
          label: "เมทาแลกซิล 35% ดีเอส",
          value: "1",
          description: "ป้องกันกำจัดโรคราน้ำค้าง,ใช้เมทาแลกซิลในอัตรา 7-10 กรัม/เมล็ด 1 กิโลกรัม คลุกเมล็ดก่อนปลูกสามารถป้องกันกาจัดโรคราน้ำค้างได้ตลอดฤดูปลูกและเมื่อข้าวโพดอายุ ๅ สัปดาห์ให้พ่นทุกสัปดาห์ติดต่อกันจำนวน 4 สัปดาห์ สามารถป้องกันโรคราน้ำค้างได้ดีที่สุด",
          category: "1",
        },
        {
          label: "เมทาแลกซิลเอ็ม 35% อีเอส",
          value: "2",
          description: "ป้องกันกำจัดโรคราน้ำค้าง,ใช้ในอัตรา 3-5 มิลลิลิตรต่อเมล็ดพันธุ์ 1 กิโลกรัม คลุกเมล็ดก่อนปลูกสามารถป้องกันกำจัดโรคราน้ำค้าง",
          category: "2",
        },
        {
          label: "ไดเมโทมอร์ฟ 50 ดับเบิ้ลยูพี",
          value: "3",
          description: "ป้องกันกำจัดโรคราน้ำค้าง,คลุกเมล็ดก่อนปลูกด้วยสารเคมีไดเมทโทมอร์ฟ 20 กรัมต่อเมล็ด 1 กิโลกรัม และพ่นที่อัตรา 20 กรัมต่อน้า 20 ลิตร เมื่อข้าวโพดอายุ 10 วัน และพ่นทุก 7 วันรวม 3 ครั้ง สามารถควบคุมโรคราน้าค้างได้ดีที่สุด เปอร์เซ็นต์การเป็นโรค 16.6 เปอร์เซ็นต์ ในแหล่งปลูกที่เคยมีการระบาดของโรค หากมีอุณหภูมิต่ำและมีความชื้นในอากาศสูง เมื่อต้นข้าวโพดมีอายุ 5-7 วัน ควรพ่นด้วยสารป้องกันกำจัดโรคพืช ไดเมโทมอร์ฟ 50 ดับเบิ้ลยูพี อัตรา 20-30 กรัมต่อน้ำ 20 ลิตร พ่นทุก 7 วัน และพ่นติดต่อกัน 3-4 ครั้ง",
          category: "3",
        },
        {
          label: "เมทาแลกซิล 25 ดับบลิวพี",
          value: "4",
          description: "ป้องกันกำตัดโรคน้ำค้าง,ในแหล่งปลูกที่เคยมีการระบาดของโรค หากมีอุณหภูมิต่ำและมีความชื้นในอากาศสูง เมื่อต้นข้าวโพดมีอายุ 5-7 วัน ควรพ่นด้วยสารป้องกันกำจัดโรคพืช ด้วยเมทาแลกซิล 25 ดับบลิวพี ใช้ในอัตรา 30-40 กรัมต่อน้ำ 20 ลิตร พ่นทุก 7 วัน และพ่นติดต่อกัน 3-4 ครั้ง",
          category: "4",
        },
        {
          label: "สกอร์ (ไดพีโนคลอนาโซล 25 %)",
          value: "5",
          description: "ป้องกันกำจัดโรคราสนิม,ใช้ในอัตรา 20-30 ซีซี ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคราสนิม พ่นทุก 7 วัน จำนวน 2-4 ครั้ง",
          category: "5",
        },
        {
          label: "แมนโคแซบ 80",
          value: "6",
          description: "ป้องกันกำจัดโรคราสนิม,ใช้ในอัตรา 40 กรัมต่อน้า 20 ลิตร พ่นป้องกันการระบาดของโรคราสนิม พ่นทุก 7 วัน จำนวน 2-4 ครั้ง",
          category: "6",
        },
        {
          label: "อามูเร่ 300 อีซี",
          value: "7",
          description: "ป้องกันกำจัดโรคราสนิมและโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 15-20 ซีซี. ต่อน้ำ 20 ลิตร พ่นเมื่อพบการระบาดของโรคติดต่อกันทุก 7 วัน ระยะฉีดพ่นครั้งสุดท้ายก่อนเก็บเกี่ยวผลผลิตประมาณ 14 วัน",
          category: "7",
        },
        {
          label: "อมิสตา อะซอกซีสโตรบิน 25%",
          value: "8",
          description: "ป้องกันกำจัดโรคราสนิม,ใช้ในอัตรา 5-10 มิลลิลิตร ผสมน้ำ 20 ลิตร พ่นป้องกันการระบาดโรคราสนิม ทุก 7-10 วัน",
          category: "8",
        },
        {
          label: "ไตรโฟรีน 20 (ซาพรอล)",
          value: "9",
          description: "ป้องกันกำจัดโรคใบไหม้แผลเล็ก,ใช้ในอัตรา 60 มิลลิลิตรต่อน้า 20 ลิตร พ่นป้องกันการรระบาดของโรคใบไหม้แผลเล็ก ทุก 7 วัน",
          category: "9",
        },
        {
          label: "บูลโลไซด์ (ซีเนบ)",
          value: "10",
          description: "ป้องกันกำจัดโรคใบไหม้แผลเล็ก,ใช้ในอัตรา 30 กรัม ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคใบไหม้แผลเล็กและพ่นซ้ำทุก 7 วัน",
          category: "10",
        },
         {
          label: "เอร่า โพรพิเนบ",
          value: "11",
          description: "ป้องกันกำจัดโรคใบไหม้แผลเล็ก,ใช้ในอัตรา 60 กรัม ต่อน้ำ 20 ลิตร  พ่น 2 ครั้ง  ครั้งแรกเมื่อเริ่มพบการระบาดของโรคใบไหม้แผลเล็กและพ่นครั้งที่ 2 ห่างจากครั้งแรก 10 วัน",
          category: "11",
        },
         {
          label: "โพรพิเนบ 70",
          value: "12",
          description: "ป้องกันกำจัดโรคใบไหม้แผลเล็ก,ใช้ในอัตรา 50 กรัม ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคใบไหม้แผลเล็ก พ่นทุก 7 วัน",
          category: "12",
        },
         {
          label: "โพรพิโคนาโซล 25%",
          value: "13",
          description: "ป้องกันกำจัดโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 20 ซีซี ต่อน้ำ 20 ลิตร เมื้อพบการแพร่ระบาดของโรคใบไหม้แผลใหญ่",
          category: "13",
        },
        {
          label: "คาร์เบนดาซิม-เอฟ",
          value: "14",
          description: "ป้องกันกำจัดโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 25 ซีซี ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคใบไหม้แผลใหญ่",
          category: "14",
        },
        {
          label: "อีโปนอล",
          value: "15",
          description: "ป้องกันกำจัดโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 20 มล ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคใบไหม้แผลใหญ่",
          category: "15",
        },
        {
          label: "ออติวา (ไดฟีโนโคนาโซล + อะซอกซีสโตรบิน",
          value: "16",
          description: "ป้องกันโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 5-10 มิลลิลิตร ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของโรคใบไหม้แผลใหญ่ พ่นซ้ำทุก 10 วัน",
          category: "16",
        },
        {
          label: "เอ็กซ์มาลา",
          value: "17",
          description: "ป้องกันกำจัดเพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อนที่เป็นพาหะของโรคใบด่างแคระและโรคใบด่างอ้อย,ใช้ในอัตรา 20 มิลลิตร ต่อน้ำ 20 ลิตร พ่นป้องกันการระบาดของแมลงศัตรูพืช เพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อน",
          category: "17",
        },
        {
          label: "ลีน่อน",
          value: "18",
          description: "ป้องกันกำจัดเพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อน ที่เป็นพาหะของโรคใบด่างแคระและโรคใบด่างอ้อย,ใช้ในอัตรา 20-30 ซีซี ต่อน้ำ 20 ลิตร พ่นป้องกันกำจัดเพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อน ถ้าพบการระบาดอย่างรุนแรงใช้ในอัตรา 40-50 ซีซี ผสมน้ำ 20 ลิตร ทุก 7 วัน",
          category: "18",
        },
        {
          label: "คาร์บาริล (85% WP)",
          value: "19",
          description: "ป้องกันกำจัดเพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อน  ที่เป็นพาหะของโรคใบด่างแคระและโรคใบด่างอ้อย,ใช้ในอันตรา 50 กรัมต่อน้ำ 20 ลิตร พ่นเฉพาะบริเวณที่เพลี้ยอ่อนลงทำลาย เมื่อพบความหนาแน่นของเพลี้ยอ่อนข้าวโพดและเพลี้อ่อนมากกว่า 25% ของพื้นที่ใบทั้งต้น โดยเฉพาะระยะที่ข้าวโพดแทงช่อดอกตัวผู้",
          category: "19",
        },
        {
          label: "ไบริน",
          value: "20",
          description: "ป้องกันกำจัดเพลี้ยอ่อนและเพลี้ยอ่อนข้าวโพด  ที่เป็นพาหะของโรคใบด่างแคระและโรคใบด่างอ้อย,ใช้อัตรา 30-50 ซีซี ต่อน้ำ 20 ลิตร พ่นป้องกันกำจัดการระบาดของเพลี้ยอ่อนข้าวโพดและเพลี้ยอ่อน",
          category: "20",
        },
        {
          label: "แอนทราโคล",
          value: "21",
          description: "ป้องกันกำจัดโรคใบไหม้แผลใหญ่,ใช้ในอัตรา 30 กรัมต่อน้ำ 20 ลิตร พ่นทุก 7-10 วัน",
          category: "21",
        },
      ]

    return {
      name,
      age,
      accept,
      model,
      options,
      onSubmit () {
        if (accept.value !== true) {
          $q.notify({
            color: 'red-5',
            textColor: 'white',
            icon: 'warning',
            message: 'You need to accept the license and terms first'
          })
        }
        else {
          $q.notify({
            color: 'green-4',
            textColor: 'white',
            icon: 'cloud_done',
            message: 'Submitted'
          })
        }
      },

      onReset () {
        name.value = null
        age.value = null
        accept.value = false
      }

    }
  },
};
</script>

