<template>
<!-- ทดสอบ 1-->
  <div class="q-pa-md" style="max-width: 300px">
    <div class="q-gutter-md">
      <q-badge color="yellow" multi-line> Model: "{{ model }}" </q-badge>

      <q-select
        filled
        v-model="model"
        :options="options"
        label="ตรวจแปลง"
      />
    </div>
  </div>
</template>

<script>
import { ref } from "vue";

export default {
  setup() {
    return {
      model: ref(null),

      options: [
        {
          label: "แบบยกร่อง",
          value: "1",
          description: "แปลงปลูกพืชที่เป็นสี่เหลี่ยมและแปลงยกร่องหรือตามความสะดวกของเกษตรกร สุ่มสำรวจ 10 จุดๆละ 10 ต้น หรือตามความเหมาะสม ตัวอย่างพืช 100 ต้นต่อ 1 แปลง",
          category: "1",
        },
        {
          label: "สุ่มทั่วแปลง",
          value: "2",
          description: "แปลงที่มีรูปทรงไม่แน่นอนหรือขึ้นอยู่กับความสะดวกของเกษตรกร สุ่มสำรวจ 10 จุดๆละ 10 ต้น หรือตามความเหมาะสม ตัวอย่างพืช 100 ต้นต่อ 1 แปลง",
          category: "2",
        },
        {
          label: "สลับฟันปลา",
          value: "3",
          description: "แปลงปลูกพืชที่เป็นสี่เหลี่ยมหรือแปลงปลูกพืชที่มีรูปทรงไม่แน่นอนและขึ้นอยู่กับความสะดวกของเกษตรกร สุ่มสำรวจ 10 จุดๆละ 10 ต้น หรือตามความเหมาะสม ตัวอย่างพืช 100 ต้นต่อ 1 แปลง",
          category: "3",
        },
        {
          label: "แปลงยกร่อง",
          value: "4",
          description: "แปลงปลูกพืชที่เป็นสี่เหลี่ยมและแปลงยกร่องหรือตามความสะดวกของเกษตรกร สุ่มสำรวจ 10 จุดๆละ 10 ต้น หรือตามความเหมาะสม ตัวอย่างพืช 100 ต้นต่อ 1 แปลง",
          category: "4",
        },
        {
          label: "แถว",
          value: "5",
          description: "แปลงปลูกพืชที่เป็นสี่เหลี่ยมหรือแปลงปลูกพืชที่มีรูปทรงไม่แน่นอนและขึ้นอยู่กับความสะดวกของเกษตรกร สุ่มสำรวจ 10 จุดๆละ 10 ต้น หรือตามความเหมาะสม ตัวอย่างพืช 100 ต้นต่อ 1 แปลง",
          category: "5",
        },
      ],
    };
  },
};
</script>
<!-- tavisuk2517@gmail.com -->
<!-- vit2517 -->
